In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math as math
import random as rnd
fortune = pd.read_csv(r'E:\PythonAnacondaScripts\course-files\Fortune_500_2017.csv', usecols=['Rank','Title','Employees','Profits','Assets'],
                   low_memory=False, index_col='Rank')

In [36]:
fortune['RankByEmployee'] = fortune['Employees'].rank(ascending = False)
fortune['RankByProfits'] = fortune['Profits'].rank(ascending = False)
fortune

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
1,Walmart,2300000,13643.0,198825,1.0,11.0
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0
3,Apple,116000,45687.0,321686,57.0,1.0
4,Exxon Mobil,72700,7840.0,330314,94.0,27.0
5,McKesson,68000,2258.0,56563,104.5,102.0
...,...,...,...,...,...,...
496,Michaels Cos.,31000,378.2,2148,218.0,330.0
497,Toll Brothers,4200,382.1,9737,475.0,328.5
498,Yahoo,8500,-214.3,48083,420.5,456.5
499,Vistra Energy,4431,-214.3,15167,474.0,456.5
500,ABM Industries,110000,57.2,2281,60.5,427.0

In [37]:
isEmployeesRankFirst10 = fortune.RankByEmployee <= 10

In [38]:
fortune[isEmployeesRankFirst10]

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
1,Walmart,2300000,13643.0,198825,1.0,11.0
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0
12,Amazon.com,341400,2371.0,83402,8.0,96.0
18,Kroger,443000,1975.0,36505,2.0,117.0
23,Home Depot,406000,7957.0,42966,5.0,26.0
32,IBM,414400,11872.0,117470,4.0,16.0
46,UPS,335520,3431.0,40377,10.0,71.0
58,FedEx,335767,1820.0,46064,9.0,124.0
112,McDonald’s,375000,4686.5,31024,6.0,51.0
399,Yum China Holdings,420000,502.0,3727,3.0,300.0

In [39]:
isProfitRankFirst10 = fortune.RankByProfits <= 10

In [27]:
fortune[isProfitRankFirst10]

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
115,ConocoPhillips,13300,-3615.0,89772,358.0,5.0
127,Sears Holdings,140000,-2221.0,9362,44.0,10.0
173,Halliburton,50000,-5763.0,27000,148.5,2.0
175,Freeport-McMoRan,30000,-4154.0,37317,226.5,4.0
196,FirstEnergy,15707,-6177.0,43148,333.0,1.0
231,Devon Energy,3545,-3302.0,25913,481.0,6.0
285,Baker Hughes,33000,-2738.0,19034,208.0,8.0
343,Chesapeake Energy,3300,-4401.0,13028,484.0,3.0
344,Anadarko Petroleum,4500,-3071.0,45564,473.0,7.0
375,National Oilwell Varco,36384,-2412.0,21140,198.0,9.0

In [40]:
fortune[isProfitRankFirst10 & isEmployeesRankFirst10]

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0

In [35]:
fortune.head()

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
1,Walmart,2300000,13643.0,198825,1.0,490.0
2,Berkshire Hathaway,367700,24074.0,620854,7.0,498.0
3,Apple,116000,45687.0,321686,57.0,500.0
4,Exxon Mobil,72700,7840.0,330314,94.0,474.0
5,McKesson,68000,2258.0,56563,104.5,399.0